## Plan Result (688: zr_sbox_acr - TerraformPlanApply)




<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_user_assigned_identity.acr_identity[&#34;hmctssbox&#34;]
* Update
  * azurerm_container_registry.container_registry[&#34;hmctssbox&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_container_registry.container_registry["hmctssbox"] will be updated in-place
  ~ resource "azurerm_container_registry" "container_registry" {
        id                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cnp-acr-rg/providers/Microsoft.ContainerRegistry/registries/hmctssbox"
        name                          = "hmctssbox"
        tags                          = {
            "application"  = "core"
            "builtFrom"    = "hmcts/acr-build-infrastructure"
            "businessArea" = "CFT"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (18 unchanged attributes hidden)

      + identity {
          + identity_ids = (known after apply)
          + type         = "UserAssigned"
        }
    }

  # azurerm_user_assigned_identity.acr_identity["hmctssbox"] will be created
  + resource "azurerm_user_assigned_identity" "acr_identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "hmctssbox-identity"
      + principal_id        = (known after apply)
      + resource_group_name = "cnp-acr-rg"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/acr-build-infrastructure"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + tenant_id           = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>





## :warning: Errors

* failed to add a label 688: zr_sbox_acr - TerraformPlanApply/add-or-update: label name is too long (max: 50)
<!-- github-comment: {"Command":"plan","PRNumber":41,"Program":"tfcmt","SHA1":"","Target":"688: zr_sbox_acr - TerraformPlanApply","Vars":{}} -->